In [26]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix
from sklearn.metrics import log_loss
from sklearn.metrics import mean_squared_error as mse

In [2]:
df = pd.read_csv('df.csv')

In [3]:
df.head()

,Unnamed: 0,CreditScore,Geography,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender
0,0,619,France,42,2,0.00,1,1,1,101348.88,1,0
1,1,608,Spain,41,1,83807.86,1,0,1,112542.58,0,0
2,2,502,France,42,8,159660.80,3,1,0,113931.57,1,0
3,3,699,France,39,1,0.00,2,0,0,93826.63,0,0
4,4,850,Spain,43,2,125510.82,1,1,1,79084.10,0,0

In [6]:
df = df.drop('Unnamed: 0',axis=1)

In [7]:
df.head()

,CreditScore,Geography,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender
0,619,France,42,2,0.00,1,1,1,101348.88,1,0
1,608,Spain,41,1,83807.86,1,0,1,112542.58,0,0
2,502,France,42,8,159660.80,3,1,0,113931.57,1,0
3,699,France,39,1,0.00,2,0,0,93826.63,0,0
4,850,Spain,43,2,125510.82,1,1,1,79084.10,0,0

In [8]:
up_df = pd.get_dummies(df)

In [10]:
up_df.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,gender,Geography_France,Geography_Germany,Geography_Spain
0,619,42,2,0.00,1,1,1,101348.88,1,0,1,0,0
1,608,41,1,83807.86,1,0,1,112542.58,0,0,0,0,1
2,502,42,8,159660.80,3,1,0,113931.57,1,0,1,0,0
3,699,39,1,0.00,2,0,0,93826.63,0,0,1,0,0
4,850,43,2,125510.82,1,1,1,79084.10,0,0,0,0,1

In [11]:
X = up_df.drop('Exited',axis=1)
y = up_df['Exited']

In [13]:
X_train, X_test, y_train, y_test = train_test_split(X,y,random_state=1)

In [15]:
model = LogisticRegression()

In [16]:
model.fit(X_train,y_train)

LogisticRegression()

In [17]:
pred = model.predict(X_test)

In [18]:
pred

array([0, 0, 0, ..., 0, 0, 0])

In [21]:
accuracy_score(pred,y_test)

0.7876

In [23]:
confusion_matrix(pred,y_test)

array([[1946,  497],
       [  34,   23]])

In [27]:
mse(pred,y_test)

0.2124